export const {
{date: 'March 23, 2023',hadith:	حضور صلی اللہ علیہ وسلم نے فرمایا :"سحری برکت کی چیز ہے اللہ نے اس سے تم کو نوازا،اس لئے تم اس کو کبھی نہ چھوڑنا"۔سنن نسائی حدیث نمبر2164
{date: 'March 24, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جب تم روزہ کھولو،تو کھجور سے افطار کرو کیونکہ یہ سراپا برکت ہے اگر کھجور نہ ملے تو پانی سے روزہ افطار کرو، کیونکہ پانی(ظاہر و باطن کو) پاک کرنے والا ہے۔"ترمزی شریف حدیث نمبر 658
{date: 'March 25, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نےفرمایا :"جو شخص عشاء کی نماز جماعت کیساتھ پڑھے گویا اس نے آدھی رات عبادت کی اور جو فجر کی نماز جماعت سے پڑھ لے گویا اس نے ساری رات عبادت کی۔"صحیح مسلم حدیث نمبر1491
{date: 'March 26, 2023',hadith:	رسول صلی اللہ علیہ وسلم افطار کرتے تو یہ دعا پڑھتے(ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ الْعُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ)ترجمہ:پیاس بجھ گئی،رگیں تر ہوگئیں اور انشاءاللہ اجرو ثواب بھی ملے گا۔ ابو داؤدحدیث نمبر2357
{date: 'March 27, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جو رمضان کی رات ثواب کے شوق میں نماز(تراویح ) پڑھتا ہو اس کے پچھلے سب گناہ معاف ہو جاتے ہیں۔"صحیح بخاری حدیث نمبر 37
{date: 'March 28, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جو شخص رمضان میں ایمان کی حالت میں ثواب کی نیت سے(عبادت ) کیلئے کھڑا ہو تو وہ گناہوں سے اس طرح پاک ہو جاتا ہے،جس طرح اس کی ماں نے اسے جنا تھا۔"سنن نسائی حدیث نمبر2210
{date: 'March 29, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جو شخص حلال کمائی سے رمضان المبارک میں روزہ دار کو افطار کرائے اس پر رمضان کی راتوں میں فرشتے رحمت بھیجتے ہیں۔"تر غیب حدیث نمبر1411
{date: 'March 30, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"رمضان ایسا مہینہ ہے کہ جس کے روزوں کو اللہ تعالی' نے تم پر فرض کیا ہے اور میں نےتمہارے لئیے اس کی تراویح کو سنت قرار دیا ہے۔"ابن ماجہ حدیث نمبر1328
{date: 'March 31, 2023',hadith:	قرآن میں اللہ تعالی' فرماتا ہے:"تم میں سے ایک جماعت ایسی ہونی چاہئیے، جو نیکی اور بھلائی کی طرف بلائے اور نیک کام کرنے کا حکم کرے اور برائی سے روکے۔"سورہ آل عمران آیت نمبر 104
{date: 'April 01, 2023',hadith:	قرآن میں اللہ تعالی ٰ فرماتا ہے۔"جوکچھ تمہارے پاس(دنیا میں )ہےوہ(ایک دن )ختم ہوجائےگا اور جو اللہ تعالٰی کے پاس ہے وہ ہمیشہ باقی رہنے والی چیز ہے۔سورہ النحل آیت نمبر96
{date: 'April 02, 2023',hadith:	قرآن میں اللہ تعالٰی فرماتا ہے:"جو شخص بیمار ہویا سفر میں ہو،تو دوسرے دنوں میں شمار کرکے اس میں(روزہ ) رکھنا (واجب) ہے"سورہ بقرہ آیت نمبر 185
{date: 'April 03, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"سراسر ظلم،کفر اورنفاق ہے،اس شخص کا فعل  جو مؤذن کی آواز سنے اور نمازکو نہ جائے۔"طبرانی کبیر حدیث نمبر16804
{date: 'April 04, 2023',hadith:	قرآن میں اللہ تعالٰی فرماتا ہے:"نیکی اور پرہیزگاری کے کاموں میں ایک دوسرے کی مدد کیا کرو،گناہ اور ظلم و زیادتی میں کسی کی مدد نہ کرو  اور اللہ سے ڈرتے رہو، بےشک اللہ تعالٰی کا عذاب بہت سخت ہے۔"سورہ مائدہ آیت نمبر2
{date: 'April 05, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جس نے صبح کی نماز ادا کی،وہ اللہ کی حفاظت میں ہے۔""صحیح مسلم حدیث نمبر1493
{date: 'April 06, 2023',hadith:	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"کسی غریب کو دینے پر(صرف ) صدقہ کا ثواب ملتا ہے لیکن (غریب)رشتےدار کو(دینے پر) دہرا اجر ملتا ہے(ایک)صدقہ کا(دوسرا) صلہ رحمی کا۔"مستدرک حدیث نمبر1476
{date: 'April 07, 2023',hadith:	حضرت عبداللہ بن عباس رضی اللہ تعالیٰ عنہہُ سے کسی نے پوچھا کہ ایک شخص دن بھر روزہ رکھتا ہے اور رات بھر نفل پڑھتا ہے مگر جمعہ اور جماعت میں شریک نہیں ہوتا(اس کے متعلق کیا حکم ہے) تو عبداللہ بن عباس رضی اللہ تعالیٰ عنہہُ نے فرمایا:یہ شخص جہنمی ہے۔ترمزی شریف  حدیث نمبر 218
{date: 'April 08, 2023',	
رسول اللہ  صلی اللہ علیہ وسلم تربوز کو کھجور کے ساتھ کھاتے اور فرماتے کہ  ہم اس کھجور کی گرمی کو تربوز کی ٹھنڈک کے زریعہ اور تربوز کی ٹھنڈک کو کھجور کی گرمی کے زریعہ ختم کرتے ہیں۔ابو داؤد حدیث نمبر 3836

{date: 'April 09, 2023'	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"اپنے ایمان کو تازہ کرتے رہا کرو،یعنی  لَآ اِلٰہَ اِلَّا اللہُ  کو کثرت سے پڑھتے رہا کرو"مسند احمد حدیث نمبر 8493
 {date: 'April 10, 2023'	 رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"اللہ تعالیٰ ہر گناہ کو معاف  کر سکتا ہے،مگر اس  آدمی کو معاف نہیں  کرتا،جو شرک کی حالت میں مرجائے،دوسرا وہ آدمی  جو کسی مسلمان بھائی کو جان بوجھ کر قتل کردے۔"ابو داؤد حدیث  نمبر 4270
 {date: 'April 11, 2023'	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"صدقہ  مصیبت کے ستر دورازے بند کر دیتا ہے۔"طبرانی کبیر حدیث نمبر 4276
 {date: 'April 12, 2023'	
رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جو شخص لیلتہ القدر میں ایمان اور  ثواب کی نیت سے(عبادت کیلئے)کھڑا ہوگا،تو اس کے اگلے سارے گناہ معاف کر دیئے جائیں گے۔"صحیح بخاری حدیث نمبر 37

 {date: 'April 13, 2023'	رسول اللہ صلی اللہ علیہ وسلم سے معلوم کیا گیا کہ رمضان کے بعد کون سے روزے افضل ہیں ؟ فرمایا شعبان کے،رمضان کی تعظیم کی وجہ سے عرض کیا گیا کون سا صدقہ افضل ہے؟ فرمایا   رمضان میں صدقہ کرنا۔ترمزی شریف حدیث نمبر 663
 {date: 'April 14, 2023'	رسول اللہ صلی اللہ علیہ وسلم عیدالفطر کے دن  عید گاہ جانے سے پہلے  چند کھجوریں تناول فرماتے تھے اور ان کی تعداد  طاق ہوتی تھی(یعنی  تین،پانچ،سات وغیرہ)۔صحیح بخاری حدیث نمبر 953
 {date: 'April 15, 2023'	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جو بندہ یہ چاہتاہے کہ اللہ تعالیٰ رنج و مصیبت کے وقت  اس کی دعا قبول کرے،تو اس کو چاہئیے کہ آرام و راحت  میں بھی خوب دعا کیا کرے۔"ترمزی شریف حدیث نمبر3382
 {date: 'April 16, 2023'	رسول اللہ صلی اللہ علیہ وسلم عید گاہ ایک راستہ سے تشریف لیجاتے اور دوسرے راستہ سے تشریف لاتے۔ابو داؤد حدیث نمبر 1156
 {date: 'April 17, 2023'	
رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"اللہ تعالی ٰرات کےآخری حصہ میں  بندوں سے بہت زیادہ قریب ہوتے ہیں ،اگر تم سے ہو سکے  تو اس وقت اللہ تعالیٰ کا زکر کیا کرو"۔مستدرک حاکم حدیث نمبر 1162

 {date: 'April 18, 2023'	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"بے حیائی اور فضول باتوں سے رکنا  روزہ کی صفائی ہے اور غریبوں کے  کھانے  کے انتظام کیلئے  صدقۂ فطر واجب ہے۔"ابو داؤد حدیث  نمبر1609
 {date: 'April 19, 2023'	قر آن میں اللہ تعالیٰ فرماتا ہے:"ایسے نمازیوں کیلئے بڑی خرابی ہے،جو اپنی نمازوں  کی طرف سے  غفلت اور سستی برتتے ہیں،جو صرف ریاکاری کرتے ہیں۔"سورۃ الماعون آیت نمبر 4 تا 6 
 {date: 'April 20, 2023'	حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہُ فرماتے ہیں:رسول اللہ صلی اللہ علیہ وسلم عیدالفطر کے دن  گھر سے نکل کرعیدگاہ جاتے ہوئے راستے میں تکبیر پڑھا کرتے تھے۔" اَللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ، لَا إِلَهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، وَلِلَّهِ الْحَمْدُ " سنن دار قطنی حدیث نمبر1733
 {date: 'April 21, 2023'	رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:"جو باطل پر رہتے ہوئے جھوٹ بات چھوڑ دے،اس کے لئے جنت کے ارد گرد گھر بنایا جائے گااور جو حق پر رہتے ہوئے جھگڑا چھوڑ دے،اس کے لئے جنت  کے بالکل بیچ میں  گھر بنایا جائے گا۔"ترمزی شریف حدیث نمبر 1993
}